%Вспомогательная функция для метода Рунге-Кутта 4го порядка для решения уравнения Шредингера. Вычисляет необходимые кофэффициенты. См. Калиткин
%стр 249. 
function [k q]=k_q(i, psi1, psi2, E)
global N
global l_lattice
global m
k = zeros(1, 4);
q = zeros(1, 4);
%Шаг сетки
h = 1/N;
%Коэффициент перевода из эВ в эрг
coeff = 1.602*10^(-12);
%Постоянная планка в эрг*с
h_plank = 1.054*10^(-27);
%Коэффициент в уравнении шредингера. В итоге получаем такую систему
%psi1' = psi2
%psi2' = gamma(U-E)*psi1
U = u();
gamma =  2*m*l_lattice^2*10^(-14) * coeff/h_plank^2;
k(1) = psi2;
q(1) = psi1*gamma*(U(2*i - 1)-E);
k(2) = psi2 + 0.5*h*q(1);
q(2) = (psi1 + 0.5*h*k(1))*gamma*(U(2*i)-E);
k(3) = psi2 + 0.5*h*q(2);
q(3) = (psi1 + 0.5*h*k(2))*gamma*(U(2*i)-E);
k(4) = psi2 + h*q(3);
q(4) = (psi1 + h*k(3))*gamma*(U(2*i+1)-E);


